Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainUnsortableBucket Property
 The chains formed by these curve elements cannot be ordered consistently in the their grid interval and will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainUnsortableBucket { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainUnsortableBucket As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainUnsortableBucket {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainUnsortableBucket : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace